glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_K20_DFP.pdsc
        <book name="Documents/K20P64M50SF0RM.pdf" title="MK20DN64xxx5 Reference Manual"/>
        <book name="Documents/K20P64M50SF0.pdf"   title="MK20DN64xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX128xxx5  ****************************** -->
      <device Dname="MK20DX128xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK20D5.h" define="MK20DX128xxx5"/>
        <debug svd="SVD/MK20D5.svd"/>
        <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                        start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                        start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D32_50MHZ.FLM"  start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K20P64M50SF0RM.pdf" title="MK20DX128xxx5 Reference Manual"/>
        <book name="Documents/K20P64M50SF0.pdf"   title="MK20DX128xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX32xxx5  ****************************** -->
      <device Dname="MK20DX32xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK20D5.h" define="MK20DX32xxx5"/>
        <debug svd="SVD/MK20D5.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00001000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFF000" size="0x00001000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P32_50MHZ.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        <algorithm name="Flash/MK_D32_50MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K20P64M50SF0RM.pdf" title="MK20DX32xxx5 Reference Manual"/>
        <book name="Documents/K20P64M50SF0.pdf"   title="MK20DX32xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX64xxx5  ****************************** -->
      <device Dname="MK20DX64xxx5">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <compile header="Device/Include/MK20D5.h" define="MK20DX64xxx5"/>
        <debug svd="SVD/MK20D5.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00002000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFE000" size="0x00002000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P64_50MHZ.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        <algorithm name="Flash/MK_D32_50MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K20P64M50SF0RM.pdf" title="MK20DX64xxx5 Reference Manual"/>
        <book name="Documents/K20P64M50SF0.pdf"   title="MK20DX64xxx5 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX128xxx7  ****************************** -->
      <device Dname="MK20DX128xxx7">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MK20D7.h" define="MK20DX128xxx7"/>
        <debug svd="SVD/MK20D7.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00004000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFFC000" size="0x00004000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P128.FLM"      start="0x00000000" size="0x00020000"             default="1"/>
        <algorithm name="Flash/MK_D32_72MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K20P100M72SF1RM.pdf" title="MK20DX128xxx7 Reference Manual"/>
        <book name="Documents/K20P100M72SF1.pdf"   title="MK20DX128xxx7 Data Sheet"/>
      </device>

      <!-- ******************************  MK20DX256xxx7  ****************************** -->
      <device Dname="MK20DX256xxx7">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MK20D7.h" define="MK20DX256xxx7"/>
        <debug svd="SVD/MK20D7.svd"/>
        <memory id="IROM1"                       start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IROM2"                       start="0x10000000" size="0x00008000" startup="0" default="0"/>
        <memory id="IRAM1"                       start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                       start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256.FLM"      start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK_D32_72MHZ.FLM" start="0x10000000" size="0x00008000"             default="1"/>

        <book name="Documents/K20P100M72SF1RM.pdf" title="MK20DX256xxx7 Reference Manual"/>
        <book name="Documents/K20P100M72SF1.pdf"   title="MK20DX256xxx7 Data Sheet"/>
      </device>

