glcloud/keil_v5/ARM/PACK/.Web/Keil.Kinetis_K20_DFP.pdsc
    <!-- Startup MK21F10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK21F10 CMSIS">
      <description>System Startup for NXP Kinetis MK21F10 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK21F10.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK21F10.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MK22F10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK22F10 CMSIS">
      <description>System Startup for NXP Kinetis MK22F10 devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK22F10.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK22F10.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- CMSIS Driver MK20D5 -->
    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0.0" condition="MK20D5">
      <description>GPIO driver used by RTE Drivers for Kinetis K20 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_K20.h"/>
        <file category="source" name="RTE_Driver/GPIO_K20.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="DMA" Cversion="1.0.0" condition="MK20D5">
      <description>DMA driver used by RTE Drivers for Kinetis K20 Series</description>
      <files>
        <file category="header" name="RTE_Driver/DMA_K20.h"/>
        <file category="source" name="RTE_Driver/DMA_K20.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="UART" Cversion="1.1.0" condition="MK20D5 GPIO DMA RTOS">
      <description>UART Driver for Kinetis K20 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_UART0               /* Driver UART0 */
        #define RTE_Drivers_UART1               /* Driver UART1 */
        #define RTE_Drivers_UART2               /* Driver UART2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/UART_K20.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB device" Cversion="1.2.0" condition="MK20D5 CMSIS RTOS">
      <description>USB device Driver for Kinetis K20 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD_K20.c"/>
      </files>
    </component>

    <!-- TWR-K20D50M Development Board -->
    <component Cclass="Board Support" Cgroup="TWR-K20D50M" Csub="LED" Cversion="0.0.1" condition="K20 50MHz">
      <description>LED driver for NXP TWR-K20D50M Development Board</description>
      <files>
        <file category="header" name="Boards/NXP/TWR-K20D50M/Common/LED.h"/>
        <file category="source" name="Boards/NXP/TWR-K20D50M/Common/LED.c"/>
      </files>
    </component>

  </components>

  <boards>
    <board name="TWR-K20D50M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The TWR-K20D50M is a development tool for the 50 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
    </board>

    <board name="TWR-K20D72M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The TWR-K20D72M is a development tool for the 72 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK20DX256xxx7"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
    </board>

    <board name="FRDM-K20D50M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The FRDM-K20D50M is a development tool for the 50 MHz K20 families of Kinetis microcontrollers.</description>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="K20 Series"/>
    </board>
  </boards>

  <examples>
    <!-- TWR-K20D50M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K20D50M/Blinky">
      <description>Blinky example</description>
      <board name="TWR-K20D50M" vendor="NXP" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K20D50M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K20D50M" vendor="NXP" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-K20D50M Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-K20D50M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-K20D50M" vendor="NXP" Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-K20D72M Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-K20D72M/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K20D72M" vendor="NXP" Dvendor="NXP:11" Dname="MK20DX256xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>

</package>
